Repository: captain0589/lifeindex
Catalog: LifeIndex/LifeIndex/Resources/*.lproj/Localizable.strings
Languages: th

# lifeindex.metricImportance
source: Metric Importance
th: ความสำคัญของตัวชี้วัด

# lifeindex.metricImportanceHint
source: Some metrics contribute more to your overall score:
th: ตัวชี้วัดบางตัวมีผลต่อคะแนนรวมมากกว่า:

# lifeindex.smartTimeAdjustment
source: Smart Time Adjustment
th: การปรับตามเวลาอัจฉริยะ

# lifeindex.timeAdjustmentExplanation
source: Activity metrics like steps and calories adjust throughout the day. Your morning score won't be penalized because you haven't hit your daily goals yet.
th: ตัวชี้วัดกิจกรรม เช่น ก้าวและแคลอรี่ จะปรับตลอดทั้งวัน คะแนนตอนเช้าจะไม่ลดลงเพราะยังไม่ถึงเป้าหมายประจำวัน

# lifeindex.scoreLevels
source: Score Levels
th: ระดับคะแนน

# mindfulness.viewDetails
source: View Mindfulness Details
th: ดูรายละเอียดสมาธิ

# dashboard.showingRecent
source: Showing most recent data — today hasn't synced yet
th: แสดงข้อมูลล่าสุด — วันนี้ยังไม่ซิงค์

# dashboard.noDataAvailable
source: No data available
th: ไม่มีข้อมูล

# dashboard.itsLate
source: It's Late!
th: ดึกแล้ว!

# dashboard.lateExplanation
source: Your daily metrics are still building up. Check back tomorrow morning for a complete picture.
th: ตัวชี้วัดประจำวันยังรวบรวมอยู่ กลับมาดูพรุ่งนี้เช้าเพื่อภาพรวมที่สมบูรณ์

# dashboard.todaysScore
source: Today's Score
th: คะแนนวันนี้

# dashboard.noHealthData
source: No Health Data Yet
th: ยังไม่มีข้อมูลสุขภาพ

# dashboard.healthDataExplanation
source: LifeIndex needs access to your health data. Make sure all categories are enabled in Health app settings.
th: LifeIndex ต้องการเข้าถึงข้อมูลสุขภาพ ตรวจสอบให้แน่ใจว่าเปิดใช้งานทุกหมวดหมู่ในการตั้งค่าแอป Health

# workout.details
source: Details
th: รายละเอียด

# workout.duration
source: Duration
th: ระยะเวลา

# workout.activeCalories
source: Active Calories
th: แคลอรี่ที่เผาผลาญ

# workout.distance
source: Distance
th: ระยะทาง

# workout.avgPace
source: Avg Pace
th: ความเร็วเฉลี่ย

# workout.avgHeartRate
source: Avg Heart Rate
th: อัตราการเต้นหัวใจเฉลี่ย

# workout.intensity
source: Intensity
th: ความเข้มข้น

# workout.intensity.high
source: High Intensity
th: ความเข้มข้นสูง

# workout.intensity.high.desc
source: Great cardio workout! You pushed hard.
th: คาร์ดิโอที่ยอดเยี่ยม! คุณทำได้ดีมาก

# workout.intensity.moderate
source: Moderate Intensity
th: ความเข้มข้นปานกลาง

# workout.intensity.moderate.desc
source: Solid workout with good effort.
th: ออกกำลังกายได้ดี มีความพยายาม

# workout.intensity.light
source: Light Intensity
th: ความเข้มข้นเบา

# workout.intensity.light.desc
source: Active movement, easy on the body.
th: การเคลื่อนไหวกระฉับกระเฉง ไม่หักโหมร่างกาย

# workout.intensity.low
source: Low Intensity
th: ความเข้มข้นต่ำ

# workout.intensity.low.desc
source: Gentle activity, good for recovery.
th: กิจกรรมเบาๆ ดีสำหรับการฟื้นตัว

# workout.allWorkouts
source: All Workouts
th: การออกกำลังกายทั้งหมด

# workout.totalCalories
source: Total Calories
th: แคลอรี่รวม

# workout.totalTime
source: Total Time
th: เวลารวม

# food.editFood
source: Edit Food
th: แก้ไขอาหาร

# food.deleteConfirm
source: This will permanently delete this food entry.
th: การดำเนินการนี้จะลบรายการอาหารนี้อย่างถาวร

# food.deleteEntry
source: Delete Entry?
th: ลบรายการ?

# food.goalChangeConfirm
source: This will change your daily calorie goal from %d to %d kcal. Your tracking data will remain, but progress will be calculated against the new goal.
th: การดำเนินการนี้จะเปลี่ยนเป้าหมายแคลอรี่รายวันจาก %d เป็น %d แคล ข้อมูลการติดตามจะยังคงอยู่ แต่ความคืบหน้าจะคำนวณจากเป้าหมายใหม่

# food.goal
source: Goal:
th: เป้าหมาย

# food.logFoodButton
source: Log Food
th: บันทึกอาหาร

# settings.appleHealthDesc
source: Apple Health is the primary data source for LifeIndex
th: Apple Health เป็นแหล่งข้อมูลหลักสำหรับ LifeIndex

# settings.garminDesc
source: Connect your Garmin account to sync workout and health data
th: เชื่อมต่อบัญชี Garmin เพื่อซิงค์ข้อมูลการออกกำลังกายและสุขภาพ

# onboarding.trackEverything
source: Track Everything
th: ติดตามทุกอย่าง

# reports.weekly
source: Weekly
th: รายสัปดาห์

# reports.avgSleep
source: Avg Sleep
th: เวลานอนเฉลี่ย

# reports.avgCalories
source: Avg Calories
th: แคลอรี่เฉลี่ย

# reports.title
source: Reports
th: รายงาน

# reports.healthReports
source: Health Reports
th: รายงานสุขภาพ

# greeting.morning
source: Good Morning
th: สวัสดีตอนเช้า

# greeting.afternoon
source: Good Afternoon
th: สวัสดีตอนบ่าย

# greeting.evening
source: Good Evening
th: สวัสดีตอนเย็น

# greeting.night
source: Good Night
th: ราตรีสวัสดิ์

# settings.openAppleHealth
source: Open Apple Health
th: เปิด Apple Health

# settings.dailyReminder
source: Daily Reminder
th: แจ้งเตือนประจำวัน

# settings.reminderTime
source: Reminder Time
th: เวลาแจ้งเตือน

# score.explanation.outstanding
source: Outstanding day. All your metrics are in excellent shape.
th: วันที่ยอดเยี่ยม ตัวชี้วัดทั้งหมดอยู่ในเกณฑ์ดีมาก

# score.explanation.excellent
source: Most metrics are on track. A small push could get you to Excellent.
th: ตัวชี้วัดส่วนใหญ่ดี เพิ่มอีกนิดจะถึงระดับยอดเยี่ยม

# score.explanation.good
source: Solid effort today. Focus on your weaker areas to level up.
th: ทำได้ดีวันนี้ ลองโฟกัสจุดอ่อนเพื่อยกระดับ

# score.explanation.fair.morning
source: Your day is shaping up. Sleep and vitals look decent — keep building.
th: วันกำลังเริ่มต้น การนอนและสัญญาณชีพดูโอเค สู้ต่อไป

# score.explanation.fair.evening
source: A decent day, but a couple areas could use a boost.
th: วันที่พอใช้ได้ แต่บางจุดยังปรับปรุงได้

# score.explanation.low.morning
source: Still early — your sleep and vitals set the foundation. Activity will build through the day.
th: ยังเช้าอยู่ การนอนและสัญญาณชีพเป็นพื้นฐาน กิจกรรมจะเพิ่มขึ้นตลอดวัน

# score.explanation.low.evening
source: Some metrics are off today. Prioritize what you can still control.
th: ตัวชี้วัดบางตัวไม่ดีวันนี้ จัดลำดับสิ่งที่ยังควบคุมได้

# score.explanation.veryLow.morning
source: Your day is just getting started. Focus on what's ahead, not what's missing yet.
th: วันเพิ่งเริ่มต้น โฟกัสสิ่งที่อยู่ข้างหน้า ไม่ใช่สิ่งที่ยังขาด

# score.explanation.veryLow.evening
source: Your body may need extra care today. Rest and recover.
th: ร่างกายอาจต้องการการดูแลพิเศษวันนี้ พักผ่อนและฟื้นตัว

# score.explanation.default.morning
source: Good morning — your score will build as the day progresses.
th: สวัสดีตอนเช้า คะแนนจะเพิ่มขึ้นเมื่อวันดำเนินไป

# score.explanation.default.evening
source: Take it easy. Focus on the basics: sleep, hydration, movement.
th: พักผ่อนบ้าง โฟกัสพื้นฐาน: นอน ดื่มน้ำ เคลื่อนไหว

# metric.steps
source: Steps
th: ก้าว

# metric.heartRate
source: Heart Rate
th: อัตราการเต้นหัวใจ

# metric.restingHR
source: Resting HR
th: อัตราการเต้นหัวใจขณะพัก

# metric.bloodOxygen
source: Blood Oxygen
th: ออกซิเจนในเลือด

# metric.activeCalories
source: Active Calories
th: แคลอรี่ที่เผาผลาญ

# metric.sleep
source: Sleep
th: การนอน

# metric.mindfulness
source: Mindfulness
th: สมาธิ

# metric.workouts
source: Workouts
th: ออกกำลังกาย

# workout.type.running
source: Running
th: วิ่ง

# workout.type.cycling
source: Cycling
th: ปั่นจักรยาน

# workout.type.swimming
source: Swimming
th: ว่ายน้ำ

# workout.type.walking
source: Walking
th: เดิน

# workout.type.hiking
source: Hiking
th: เดินป่า

# workout.type.yoga
source: Yoga
th: โยคะ

# workout.type.strength
source: Strength Training
th: เวทเทรนนิ่ง

# workout.type.core
source: Core Training
th: ฝึกแกนกลาง

# workout.type.flexibility
source: Flexibility
th: ยืดเหยียด

# workout.type.default
source: Workout
th: ออกกำลังกาย

# sleep.insight.healthy
source: You got a healthy amount of sleep
th: คุณนอนได้เพียงพอต่อสุขภาพ

# sleep.insight.long
source: You slept longer than average
th: คุณนอนนานกว่าค่าเฉลี่ย

# sleep.insight.needMore
source: Consider getting a bit more sleep
th: ลองนอนเพิ่มอีกสักหน่อย

# sleep.insight.aim
source: Try to aim for 7-9 hours of sleep
th: พยายามนอนให้ได้ 7-9 ชั่วโมง

# sleep.insight.greatQuality
source: Great sleep quality with good deep sleep
th: คุณภาพการนอนดี มีหลับลึกเพียงพอ

# sleep.insight.improveDeep
source: Try to improve deep sleep through regular exercise
th: ลองเพิ่มหลับลึกด้วยการออกกำลังกายสม่ำเสมอ

# sleep.insight.awakenings
source: Frequent awakenings may affect recovery
th: การตื่นบ่อยอาจส่งผลต่อการฟื้นตัว

# sleep.insight.great
source: Great sleep — %dh %dm is in the ideal 7-9hr range.
th: นอนดี — %dh %dm อยู่ในช่วง 7-9 ชม.

# importance.high
source: High
th: สูง

# importance.medium
source: Medium
th: ปานกลาง

# importance.low
source: Low
th: ต่ำ

# metricStatus.excellent
source: Excellent
th: ดีเยี่ยม

# metricStatus.good
source: Good
th: ดี

# metricStatus.fair
source: Fair
th: พอใช้

# metricStatus.needsWork
source: Needs work
th: ต้องปรับปรุง

# suggestion.enableSleep
source: Enable sleep tracking tonight
th: เปิดการติดตามการนอนคืนนี้

# sleep.7dayAvg
source: 7-day avg
th: เฉลี่ย 7 วัน

# scoreLabel.excellent
source: Excellent
th: ดีเยี่ยม

# scoreLabel.great
source: Great
th: ดีมาก

# scoreLabel.good
source: Good
th: ดี

# scoreLabel.buildingUp
source: Building Up
th: กำลังพัฒนา

# scoreLabel.roomToGrow
source: Room to Grow
th: ยังพัฒนาได้

# scoreLabel.justStarting
source: Just Starting
th: เริ่มต้นวัน

# scoreLabel.gettingStarted
source: Getting Started
th: กำลังเริ่มต้น

# recoveryLabel.fullyRecovered
source: Fully Recovered
th: ฟื้นตัวเต็มที่

# recoveryLabel.mostlyRecovered
source: Mostly Recovered
th: ฟื้นตัวเกือบเต็มที่

# recoveryLabel.partiallyRecovered
source: Partially Recovered
th: ฟื้นตัวบางส่วน

# recoveryLabel.restRecommended
source: Rest Recommended
th: ควรพักผ่อน
