Repository: captain0589/lifeindex
Catalog: LifeIndex/LifeIndex/Resources/*.lproj/Localizable.strings
Languages: th

# common.cancel
source: Cancel
th: ยกเลิก

# common.save
source: Save
th: บันทึก

# common.done
source: Done
th: เสร็จสิ้น

# common.edit
source: Edit
th: แก้ไข

# common.delete
source: Delete
th: ลบ

# common.ok
source: OK
th: ตกลง

# common.yes
source: Yes
th: ใช่

# common.no
source: No
th: ไม่

# common.loading
source: Loading...
th: กำลังโหลด...

# common.error
source: Error
th: ข้อผิดพลาด

# common.success
source: Success
th: สำเร็จ

# common.today
source: Today
th: วันนี้

# common.yesterday
source: Yesterday
th: เมื่อวาน

# common.thisWeek
source: This Week
th: สัปดาห์นี้

# common.weeklyAvg
source: Weekly Avg
th: เฉลี่ยสัปดาห์

# tab.home
source: Home
th: หน้าแรก

# tab.sleep
source: Sleep
th: การนอน

# tab.fitness
source: Fitness
th: ฟิตเนส

# tab.food
source: Food
th: อาหาร

# tab.wellness
source: Mood
th: อารมณ์

# tab.mood
source: Mood
th: อารมณ์

# tab.settings
source: Settings
th: ตั้งค่า

# dashboard.greeting
source: Hello
th: สวัสดี

# dashboard.todayScore
source: Today's Score
th: คะแนนวันนี้

# dashboard.viewScoreDetails
source: View Score Details
th: ดูรายละเอียดคะแนน

# dashboard.sleep
source: Sleep
th: การนอน

# dashboard.activity
source: Activity
th: กิจกรรม

# dashboard.heart
source: Heart
th: หัวใจ

# dashboard.recovery
source: Recovery
th: การฟื้นตัว

# dashboard.mindfulness
source: Mindfulness
th: สติ

# dashboard.viewDetails
source: View Details
th: ดูรายละเอียด

# dashboard.noData
source: No data available
th: ไม่มีข้อมูล

# dashboard.recentData
source: Showing most recent data
th: แสดงข้อมูลล่าสุด

# sleep.title
source: Sleep
th: การนอน

# sleep.timeAsleep
source: Time Asleep
th: เวลานอนหลับ

source: Sleep Quality
th: คุณภาพการนอน

# sleep.variability
source: Variability
th: ความแปรปรวน

# sleep.regularity
source: Regularity
th: ความสม่ำเสมอ

# sleep.viewDetails
source: View Sleep Details
th: ดูรายละเอียดการนอน

# sleep.hoursUnit
source: hrs
th: ชม.

# sleep.minutesUnit
source: min
th: นาที

# sleep.learnMore
source: Learn about sleep metrics
th: เรียนรู้เพิ่มเติมเกี่ยวกับการนอน

# sleep.timeAsleep.desc
source: Total time you spent asleep last night. Adults need 7-9 hours for optimal health.
th: เวลาที่คุณนอนหลับทั้งหมดเมื่อคืน ผู้ใหญ่ควรนอน 7-9 ชั่วโมงเพื่อสุขภาพที่ดี

# sleep.quality.desc
source: How well you slept based on duration. 100% means you hit the recommended 8 hours.
th: คุณภาพการนอนตามระยะเวลา 100% หมายความว่าคุณนอนครบ 8 ชั่วโมงตามที่แนะนำ

# sleep.variability.desc
source: How much your sleep time differs from night to night. Lower is better for your body's rhythm.
th: ความแตกต่างของเวลานอนในแต่ละคืน ยิ่งน้อยยิ่งดีต่อจังหวะร่างกาย

# sleep.regularity.desc
source: How consistent your sleep schedule is. A regular pattern helps you feel more rested.
th: ความสม่ำเสมอของตารางการนอน การนอนเป็นเวลาช่วยให้รู้สึกสดชื่นขึ้น

source: Sleep Stages
th: ช่วงการนอน

# sleep.awake
source: Awake
th: ตื่น

# sleep.core
source: Core
th: หลับตื้น

# sleep.deep
source: Deep
th: หลับลึก

# sleep.noData
source: No Sleep Data
th: ไม่มีข้อมูลการนอน

# sleep.noDataDesc
source: Sleep data will appear here once synced from your device
th: ข้อมูลการนอนจะแสดงที่นี่เมื่อซิงค์จากอุปกรณ์ของคุณ

# sleep.ofSession
source: of sleep session
th: ของเวลานอน

# sleep.total
source: Total
th: รวม

# sleep.totalSleep
source: Total Sleep
th: เวลานอนทั้งหมด

# sleep.weeklyOverview
source: Weekly Overview
th: ภาพรวมรายสัปดาห์

# sleep.awake.desc
source: Time spent awake during your sleep session. Some awake time is normal, but too much may indicate restless sleep.
th: เวลาที่ตื่นระหว่างการนอน เวลาตื่นบ้างเป็นเรื่องปกติ แต่ถ้ามากเกินไปอาจหมายถึงการนอนไม่สนิท

# sleep.rem.desc
source: REM (Rapid Eye Movement) sleep is when you dream. It's important for memory, learning, and emotional processing. Aim for 20-25% of total sleep.
th: การนอน REM คือช่วงที่คุณฝัน สำคัญต่อความจำ การเรียนรู้ และอารมณ์ ควรมีประมาณ 20-25% ของเวลานอน

# sleep.core.desc
source: Core (Light) sleep makes up the majority of your sleep. It helps with physical recovery and memory consolidation.
th: การนอนหลับตื้นเป็นส่วนใหญ่ของการนอน ช่วยฟื้นฟูร่างกายและความจำ

# sleep.deep.desc
source: Deep sleep is the most restorative stage. It's when your body repairs tissues and strengthens immunity. Aim for 15-20% of total sleep.
th: การนอนหลับลึกช่วยฟื้นฟูร่างกายมากที่สุด เป็นช่วงซ่อมแซมเนื้อเยื่อและเสริมภูมิคุ้มกัน ควรมีประมาณ 15-20% ของเวลานอน

# activity.title
source: Activity
th: กิจกรรม

# activity.steps
source: Steps
th: ก้าว

# activity.calories
source: Calories
th: แคลอรี่

# activity.exercise
source: Exercise
th: ออกกำลังกาย

# activity.viewDetails
source: View Activity Details
th: ดูรายละเอียดกิจกรรม

# activity.stepsThisWeek
source: Steps This Week
th: ก้าวสัปดาห์นี้

# activity.caloriesBurned
source: Calories Burned
th: แคลอรี่ที่เผาผลาญ

# heart.title
source: Heart
th: อัตราการเต้นหัวใจ

# heart.restingHR
source: Resting HR
th: อัตราการเต้นหัวใจขณะพัก

# heart.bloodOxygen
source: Blood Oxygen
th: ออกซิเจนในเลือด

# heart.viewDetails
source: View Heart Details
th: ดูรายละเอียดหัวใจ

# food.title
source: Calories
th: แคลอรี่

# food.diary
source: Diary
th: บันทึก

# food.logFood
source: Log Food
th: บันทึกอาหาร

# food.caloriesEaten
source: Calories eaten
th: แคลอรี่ที่กิน

# food.dailyGoal
source: Daily Goal
th: เป้าหมายรายวัน

# food.remaining
source: Remaining
th: เหลือ

# food.noMealsLogged
source: No meals logged
th: ยังไม่มีมื้ออาหาร

# food.whatDidYouEat
source: What did you eat?
th: คุณกินอะไร?

# food.estimateCalories
source: Estimate Calories
th: ประมาณแคลอรี่

# food.estimating
source: Estimating...
th: กำลังประมาณ...

# food.addPhoto
source: Add a photo
th: เพิ่มรูปภาพ

# food.choosePhoto
source: Choose Photo
th: เลือกรูป

# food.removePhoto
source: Remove
th: ลบ

# food.calories
source: Calories
th: แคลอรี่

# food.protein
source: Protein
th: โปรตีน

# food.carbs
source: Carbs
th: คาร์บ

# food.fat
source: Fat
th: ไขมัน

# food.macrosOptional
source: Macros (optional)
th: สารอาหาร (ไม่บังคับ)

# food.todayEntries
source: Today's Entries
th: รายการวันนี้

# food.useRecommended
source: Use Recommended
th: ใช้ค่าแนะนำ

# food.kcal
source: kcal
th: แคลอรี่

# food.grams
source: g
th: กรัม

# food.proteinEaten
source: Protein eaten
th: โปรตีนที่กิน

# food.carbsEaten
source: Carbs eaten
th: คาร์บที่กิน

# food.fatEaten
source: Fat eaten
th: ไขมันที่กิน

# food.adjustIfNeeded
source: Adjust if needed
th: ปรับได้ตามต้องการ

# food.enterMacros
source: Enter grams for detailed macro tracking
th: ใส่กรัมเพื่อติดตามสารอาหาร

# food.placeholder
source: e.g. Chicken salad
th: เช่น สลัดไก่

# fitness.title
source: Fitness
th: ฟิตเนส

# fitness.recentWorkouts
source: Recent Workouts
th: การออกกำลังกายล่าสุด

# fitness.noWorkouts
source: No Workouts
th: ไม่มีการออกกำลังกาย

# fitness.noWorkoutsDesc
source: Your workouts will appear here
th: การออกกำลังกายจะแสดงที่นี่

# fitness.recovery
source: Recovery
th: การฟื้นตัว

# fitness.viewRecoveryDetails
source: View Recovery Details
th: ดูรายละเอียดการฟื้นตัว

# fitness.considerRest
source: Consider a rest day
th: ควรพักผ่อน

# fitness.energyBurned
source: Energy Burned
th: พลังงานที่เผาผลาญ

# fitness.burnedToday
source: burned today
th: เผาผลาญวันนี้

# fitness.todaysBalance
source: Today's Balance
th: สมดุลวันนี้

# fitness.insight.deficit
source: %d kcal deficit
th: ขาดดุล %d แคลอรี่

# fitness.insight.surplus
source: %d kcal surplus
th: เกินดุล %d แคลอรี่

# fitness.insight.balanced
source: Perfectly balanced
th: สมดุลพอดี

# fitness.eaten
source: Eaten
th: กินไป

# fitness.burned
source: Burned
th: เผาผลาญ

# fitness.remaining
source: Remaining
th: เหลือ

# fitness.over
source: Over
th: เกิน

# fitness.deficitGoal
source: You have a weight loss goal (-500 kcal/day)
th: คุณมีเป้าหมายลดน้ำหนัก (-500 แคล/วัน)

# fitness.surplusGoal
source: You have a weight gain goal (+300 kcal/day)
th: คุณมีเป้าหมายเพิ่มน้ำหนัก (+300 แคล/วัน)

# fitness.weeklyWorkouts
source: This Week's Workouts
th: ออกกำลังกายสัปดาห์นี้

# fitness.days
source: days
th: วัน

# fitness.thisWeek
source: this week
th: สัปดาห์นี้

# fitness.workoutCalendar
source: Workout Calendar
th: ปฏิทินออกกำลังกาย

# fitness.workouts
source: Workouts
th: ครั้ง

# fitness.totalTime
source: Total Time
th: เวลารวม

# fitness.caloriesBurned
source: Burned
th: เผาผลาญ

# fitness.workoutDay
source: Workout Day
th: วันออกกำลังกาย

# fitness.restDay
source: Rest Day
th: วันพัก

# fitness.viewAllWorkouts
source: View All Workouts
th: ดูการออกกำลังกายทั้งหมด

# fitness.calorieStatus.underGoal
source: Under Goal
th: ต่ำกว่าเป้า

# fitness.calorieStatus.onTrack
source: On Track
th: ตรงเป้า

# fitness.calorieStatus.overGoal
source: Over Goal
th: เกินเป้า

# fitness.calorieBalance
source: Calorie Balance
th: สมดุลแคลอรี่

# wellness.title
source: Mood
th: อารมณ์

# wellness.mood
source: Mood
th: อารมณ์

# wellness.howAreYouFeeling
source: How are you feeling today?
th: วันนี้คุณรู้สึกอย่างไร?

# wellness.mood.bad
source: Bad
th: แย่

# wellness.mood.low
source: Low
th: ไม่ค่อยดี

# wellness.mood.okay
source: Okay
th: พอใช้

# wellness.mood.good
source: Good
th: ดี

# wellness.mood.great
source: Great
th: ดีมาก

# wellness.journalEntry
source: Journal Entry
th: บันทึกประจำวัน

# wellness.writeYourThoughts
source: Write your thoughts...
th: เขียนความคิดของคุณ...

# wellness.mindfulness
source: Mindfulness
th: สติ

# wellness.saveMood
source: Save Mood
th: บันทึกอารมณ์

# wellness.moodSaved
source: Mood saved!
th: บันทึกอารมณ์แล้ว!

# wellness.moodLog
source: Mood Log
th: บันทึกอารมณ์

# wellness.addNote
source: Add a note (optional)
th: เพิ่มโน้ต (ไม่บังคับ)

# wellness.mindfulMinutes
source: Mindful Minutes
th: เวลาสมาธิ

# wellness.todaysMindfulness
source: Today's mindfulness sessions
th: การฝึกสมาธิวันนี้

# wellness.stressLevel
source: Stress Level
th: ระดับความเครียด

# wellness.lowStress
source: Low Stress
th: เครียดน้อย

# wellness.moderateStress
source: Moderate
th: เครียดปานกลาง

# wellness.elevatedStress
source: Elevated
th: เครียดสูง

# wellness.highStress
source: High Stress
th: เครียดมาก

# wellness.basedOnHRV
source: Based on HRV: %@ ms
th: จาก HRV: %@ ms

# settings.title
source: Settings
th: ตั้งค่า

# settings.profile
source: Profile
th: โปรไฟล์

# settings.appearance
source: Appearance
th: หน้าตา

# settings.language
source: Language
th: ภาษา

# settings.colorScheme
source: Color Scheme
th: ธีม

# settings.systemDefault
source: System
th: ตามระบบ

# settings.light
source: Light
th: สว่าง

# settings.dark
source: Dark
th: มืด

# settings.age
source: Age
th: อายุ

# settings.weight
source: Weight
th: น้ำหนัก

# settings.height
source: Height
th: ส่วนสูง

# settings.gender
source: Gender
th: เพศ

# settings.male
source: Male
th: ชาย

# settings.female
source: Female
th: หญิง

# settings.activityLevel
source: Activity Level
th: ระดับกิจกรรม

# settings.goal
source: Goal
th: เป้าหมาย

# settings.about
source: About
th: เกี่ยวกับ

# settings.version
source: Version
th: เวอร์ชัน

# settings.privacyPolicy
source: Privacy Policy
th: นโยบายความเป็นส่วนตัว

# settings.termsOfService
source: Terms of Service
th: ข้อกำหนดการใช้งาน

# settings.sedentary
source: Sedentary
th: นั่งทำงาน

# settings.lightActivity
source: Lightly Active
th: ออกกำลังเบาๆ

# settings.moderateActivity
source: Moderately Active
th: ออกกำลังปานกลาง

# settings.activeActivity
source: Very Active
th: ออกกำลังหนัก

# settings.veryActive
source: Extremely Active
th: ออกกำลังหนักมาก

# settings.loseWeight
source: Lose Weight
th: ลดน้ำหนัก

# settings.maintainWeight
source: Maintain Weight
th: รักษาน้ำหนัก

# settings.gainWeight
source: Gain Weight
th: เพิ่มน้ำหนัก

# settings.healthData
source: Health Data
th: ข้อมูลสุขภาพ

# settings.notifications
source: Notifications
th: การแจ้งเตือน

# settings.units
source: Units
th: หน่วย

# settings.dataConnections
source: Data Connections
th: เชื่อมต่อข้อมูล

# settings.connected
source: Connected
th: เชื่อมต่อแล้ว

# settings.notConnected
source: Not Connected
th: ยังไม่เชื่อมต่อ

# settings.connect
source: Connect
th: เชื่อมต่อ

# settings.disconnect
source: Disconnect
th: ยกเลิกเชื่อมต่อ

# onboarding.welcome
source: Welcome to LifeIndex
th: ยินดีต้อนรับสู่ LifeIndex

# onboarding.welcomeSubtitle
source: Your personal health companion
th: ผู้ช่วยสุขภาพส่วนตัวของคุณ

# onboarding.selectLanguage
source: Select your language
th: เลือกภาษาของคุณ

# onboarding.continue
source: Continue
th: ดำเนินการต่อ

# onboarding.getStarted
source: Get Started
th: เริ่มต้น

# onboarding.healthPermission
source: Health Data Access
th: การเข้าถึงข้อมูลสุขภาพ

# onboarding.healthPermissionDesc
source: LifeIndex needs access to your health data to provide personalized insights and track your progress.
th: LifeIndex ต้องการเข้าถึงข้อมูลสุขภาพของคุณเพื่อให้ข้อมูลเชิงลึกและติดตามความคืบหน้า

# onboarding.allowAccess
source: Allow Access
th: อนุญาตการเข้าถึง

# onboarding.skip
source: Skip for now
th: ข้ามไปก่อน

# onboarding.features.sleep
source: Track your sleep quality
th: ติดตามคุณภาพการนอน

# onboarding.features.activity
source: Monitor daily activity
th: ติดตามกิจกรรมประจำวัน

# onboarding.features.nutrition
source: Log food & nutrition
th: บันทึกอาหารและโภชนาการ

# onboarding.features.insights
source: Get AI-powered insights
th: รับข้อมูลเชิงลึกจาก AI

# streak.title
source: Streaks & Missions
th: สถิติและภารกิจ

# streak.dayStreak
source: Day Streak
th: วันติดต่อกัน

# streak.calendar
source: Calendar
th: ปฏิทิน

# streak.missions
source: Missions
th: ภารกิจ

# streak.proTips
source: Pro Tips
th: เคล็ดลับ

# streak.keepItUp
source: Keep it up!
th: ทำต่อไป!

# streak.logFoodDaily
source: Log food daily to build your streak
th: บันทึกอาหารทุกวันเพื่อสร้างสถิติ

# streak.currentStreak
source: Current Streak
th: สถิติปัจจุบัน

# streak.longestStreak
source: Longest Streak
th: สถิติสูงสุด

# streak.totalDaysLogged
source: Total Days Logged
th: วันที่บันทึกทั้งหมด

# streak.bestStreak
source: Best Streak
th: สถิติดีสุด

# streak.totalDays
source: Total Days
th: วันทั้งหมด

# streak.motivation.0
source: Start your streak today! Log your first meal.
th: เริ่มสถิติวันนี้! บันทึกมื้อแรกของคุณ

# streak.motivation.1
source: Great start! Keep it going tomorrow!
th: เริ่มต้นดี! ทำต่อไปพรุ่งนี้!

# streak.motivation.week
source: You're building momentum! Keep it up!
th: คุณกำลังสร้างโมเมนตัม! สู้ต่อไป!

# streak.motivation.fullWeek
source: A full week! You're on fire!
th: ครบหนึ่งสัปดาห์! คุณกำลังลุกเป็นไฟ!

# streak.motivation.twoWeeks
source: Two weeks strong! You're unstoppable!
th: สองสัปดาห์แล้ว! คุณหยุดไม่ได้!

# streak.motivation.month
source: A whole month! Incredible dedication!
th: ครบหนึ่งเดือน! ความมุ่งมั่นที่น่าทึ่ง!

# streak.motivation.twoMonths
source: Two months! You're a nutrition champion!
th: สองเดือน! คุณคือแชมป์โภชนาการ!

# streak.motivation.threeMonths
source: Three months! This is now a lifestyle!
th: สามเดือน! ตอนนี้มันกลายเป็นวิถีชีวิตแล้ว!

# streak.motivation.halfYear
source: Half a year! Absolutely legendary!
th: ครึ่งปี! ยิ่งใหญ่มาก!

# streak.motivation.year
source: Over a year! You're a true master!
th: มากกว่าหนึ่งปี! คุณคือปรมาจารย์ที่แท้จริง!

# mission.firstStep.title
source: First Step
th: ก้าวแรก

# mission.firstStep.desc
source: Log your first meal
th: บันทึกมื้อแรกของคุณ

# mission.firstStep.reward
source: Welcome Badge
th: เหรียญต้อนรับ

# mission.gettingStarted.title
source: Getting Started
th: เริ่มต้น

# mission.gettingStarted.desc
source: Maintain a 3-day streak
th: รักษาสถิติ 3 วัน

# mission.gettingStarted.reward
source: Spark Badge
th: เหรียญประกายไฟ

# mission.weekWarrior.title
source: Week Warrior
th: นักรบสัปดาห์

# mission.weekWarrior.desc
source: Maintain a 7-day streak
th: รักษาสถิติ 7 วัน

# mission.weekWarrior.reward
source: Fire Badge
th: เหรียญไฟ

# mission.monthlyMaster.title
source: Monthly Master
th: เจ้าแห่งเดือน

# mission.monthlyMaster.desc
source: Maintain a 30-day streak
th: รักษาสถิติ 30 วัน

# mission.monthlyMaster.reward
source: Inferno Badge
th: เหรียญเพลิง

# mission.dedicatedLogger.title
source: Dedicated Logger
th: นักบันทึกทุ่มเท

# mission.dedicatedLogger.desc
source: Log meals on 10 different days
th: บันทึกอาหารใน 10 วันที่แตกต่างกัน

# mission.dedicatedLogger.reward
source: Consistency Badge
th: เหรียญความสม่ำเสมอ

# mission.habitBuilder.title
source: Habit Builder
th: สร้างนิสัย

# mission.habitBuilder.desc
source: Log meals on 50 different days
th: บันทึกอาหารใน 50 วันที่แตกต่างกัน

# mission.habitBuilder.reward
source: Dedication Badge
th: เหรียญความทุ่มเท

# mission.centuryClub.title
source: Century Club
th: สโมสรร้อยวัน

# mission.centuryClub.desc
source: Maintain a 100-day streak
th: รักษาสถิติ 100 วัน

# mission.centuryClub.reward
source: Legend Badge
th: เหรียญตำนาน

# streak.tip.sameTime
source: Log meals at the same time each day to build a habit
th: บันทึกอาหารในเวลาเดียวกันทุกวันเพื่อสร้างนิสัย

# streak.tip.reminders
source: Set reminders to never miss a day
th: ตั้งการแจ้งเตือนเพื่อไม่พลาดวัน

# streak.tip.photos
source: Take photos of your meals for easier logging
th: ถ่ายรูปอาหารเพื่อบันทึกได้ง่ายขึ้น

# streak.tip.aiEstimate
source: Use AI estimation for quick calorie tracking
th: ใช้ AI ประมาณแคลอรี่อย่างรวดเร็ว

# units.kcal
source: kcal
th: แคล

# units.steps
source: steps
th: ก้าว

# units.minutes
source: min
th: นาที

# units.hours
source: hrs
th: ชม.

# units.bpm
source: BPM
th: ครั้ง/นาที

# units.ms
source: ms
th: มิลลิวินาที

# units.kg
source: kg
th: กก.

# units.cm
source: cm
th: ซม.

# units.grams
source: g
th: กรัม

# day.sunday
source: Sun
th: อา.

# day.monday
source: Mon
th: จ.

# day.tuesday
source: Tue
th: อ.

# day.wednesday
source: Wed
th: พ.

# day.thursday
source: Thu
th: พฤ.

# day.friday
source: Fri
th: ศ.

# day.saturday
source: Sat
th: ส.

# meal.breakfast
source: Breakfast
th: อาหารเช้า

# meal.lunch
source: Lunch
th: อาหารกลางวัน

# meal.dinner
source: Dinner
th: อาหารเย็น

# meal.snack
source: Snack
th: ของว่าง

# score.poor
source: Poor
th: ต้องปรับปรุง

# score.fair
source: Fair
th: พอใช้

# score.good
source: Good
th: ดี

# score.excellent
source: Excellent
th: ดีมาก

# score.outstanding
source: Outstanding
th: ยอดเยี่ยม

# score.needsWork
source: Needs Work
th: ต้องปรับปรุง

# score.excellentDesc
source: Optimal health
th: สุขภาพดีเยี่ยม

# score.goodDesc
source: Healthy range
th: อยู่ในเกณฑ์ดี

# score.fairDesc
source: Room to improve
th: ยังพัฒนาได้

# score.needsWorkDesc
source: Focus area
th: ต้องใส่ใจ

# recovery.poor
source: Poor Recovery
th: ฟื้นตัวน้อย

# recovery.fair
source: Fair Recovery
th: ฟื้นตัวพอใช้

# recovery.good
source: Good Recovery
th: ฟื้นตัวดี

# recovery.excellent
source: Excellent Recovery
th: ฟื้นตัวดีมาก

# error.generic
source: Something went wrong
th: เกิดข้อผิดพลาด

# error.noInternet
source: No internet connection
th: ไม่มีการเชื่อมต่ออินเทอร์เน็ต

# error.healthKitUnavailable
source: HealthKit is not available on this device
th: HealthKit ไม่พร้อมใช้งานบนอุปกรณ์นี้

# error.permissionDenied
source: Permission denied
th: ไม่ได้รับอนุญาต

# insights.title
source: Insights
th: ข้อมูลเชิงลึก

# insights.aiPowered
source: AI Insights
th: ข้อมูลจาก AI

# insights.aiInsights
source: AI Insights
th: ข้อมูลจาก AI

# insights.viewMore
source: View More
th: ดูเพิ่มเติม

# insights.viewDetails
source: View Details
th: ดูรายละเอียด

# insights.viewHistory
source: View Insight History
th: ดูประวัติข้อมูลเชิงลึก

# insights.history
source: History
th: ประวัติ

# insights.history.title
source: Insight History
th: ประวัติข้อมูลเชิงลึก

# insights.showLess
source: Show Less
th: ดูน้อยลง

# insights.showMore
source: Show More
th: ดูเพิ่มเติม

# insights.generating
source: Generating analysis...
th: กำลังวิเคราะห์...

# insights.weeklySummary
source: Weekly Summary
th: สรุปประจำสัปดาห์

# insights.noWeeklySummary
source: Generate your weekly health summary
th: สร้างสรุปสุขภาพประจำสัปดาห์

# insights.generateSummary
source: Generate Summary
th: สร้างสรุป

# insights.generatingSummary
source: Generating summary...
th: กำลังสร้างสรุป...

# ui.avg
source: Avg
th: เฉลี่ย

# ui.average
source: Average
th: เฉลี่ย

# ui.today
source: Today
th: วันนี้

# ui.thisWeek
source: This Week
th: สัปดาห์นี้

# ui.noData
source: No data
th: ไม่มีข้อมูล

# ui.noHealthData
source: No health data available
th: ยังไม่มีข้อมูลสุขภาพ

# ui.low
source: Low
th: ต่ำสุด

# ui.high
source: High
th: สูงสุด

# ui.details
source: Details
th: รายละเอียด

# ui.metrics
source: Metrics
th: ตัวชี้วัด

# ui.summary
source: Summary
th: สรุป

# ui.export
source: Export
th: ส่งออก

# ui.takePhoto
source: Take Photo
th: ถ่ายรูป

# ui.intensity
source: Intensity
th: ความเข้มข้น

# ui.recommendation
source: Recommendation
th: คำแนะนำ

# sleep.dailyScores
source: Daily Sleep Scores
th: คะแนนการนอนรายวัน

# sleep.sleepScore
source: Sleep Score
th: คะแนนการนอน

# sleep.target
source: Target: 7-8 hours
th: เป้าหมาย: 7-8 ชั่วโมง

# sleep.noSleepData
source: No sleep data
th: ไม่มีข้อมูลการนอน

source: Sleep Stages Detail
th: รายละเอียดช่วงการนอน

# sleep.totalAsleep
source: Total Asleep
th: เวลานอนหลับรวม

# sleep.totalTimeInBed
source: Total Time in Bed
th: เวลาบนเตียงรวม

# sleep.excellent
source: Excellent
th: ยอดเยี่ยม

# sleep.great
source: Great
th: ดีมาก

# sleep.good
source: Good
th: ดี

# sleep.fair
source: Fair
th: พอใช้

# sleep.poor
source: Poor
th: ต้องปรับปรุง

# recovery.dailyScores
source: Daily Recovery Scores
th: คะแนนการฟื้นตัวรายวัน

source: Recovery Metrics
th: ตัวชี้วัดการฟื้นตัว

# recovery.details
source: Recovery Detail
th: รายละเอียดการฟื้นตัว

# recovery.viewDetails
source: View Recovery Details
th: ดูรายละเอียดการฟื้นตัว

# recovery.explanation
source: Recovery score combines HRV (40%), resting heart rate (30%), and sleep duration (30%). Higher HRV and lower resting HR indicate better recovery.
th: คะแนนการฟื้นตัวรวม HRV (40%), อัตราการเต้นหัวใจขณะพัก (30%), และเวลานอน (30%) HRV สูงและอัตราการเต้นหัวใจขณะพักต่ำ แสดงถึงการฟื้นตัวที่ดี

# recovery.restRecommended
source: Rest day recommended
th: แนะนำให้พักผ่อน

# lifeindex.dailyScores
source: Daily Scores
th: คะแนนรายวัน

# lifeindex.today
source: Today's LifeIndex
th: LifeIndex วันนี้

# lifeindex.viewDetail
source: View Today's Detail
th: ดูรายละเอียดวันนี้

# lifeindex.viewScoreDetails
source: View Score Details
th: ดูรายละเอียดคะแนน

# lifeindex.viewYesterday
source: View Yesterday's Report
th: ดูรายงานเมื่อวาน

# lifeindex.yourMetrics
source: Your Metrics
th: ตัวชี้วัดของคุณ

# lifeindex.howItWorks
source: How It Works
th: วิธีการคำนวณ

# lifeindex.noDataYet
source: No health data available yet.
th: ยังไม่มีข้อมูลสุขภาพ

# lifeindex.explanation
source: Your LifeIndex compares each health metric against an ideal range, then combines them based on importance to your overall wellness.
th: LifeIndex เปรียบเทียบตัวชี้วัดสุขภาพแต่ละตัวกับช่วงที่เหมาะสม แล้วรวมตามความสำคัญต่อสุขภาพโดยรวม

# lifeindex.weightsExplanation
source: Some metrics matter more for overall health:
th: บางตัวชี้วัดสำคัญต่อสุขภาพมากกว่า:

# lifeindex.timeAware
source: Activity metrics (steps, calories, exercise) scale throughout the day. Your morning score won't suffer because you haven't hit your daily step goal yet.
th: ตัวชี้วัดกิจกรรม (ก้าว, แคลอรี่, ออกกำลังกาย) จะปรับตามเวลาในวัน คะแนนตอนเช้าจะไม่ลดลงเพราะยังไม่ถึงเป้าก้าวประจำวัน

# lifeindex.target
source: Target:
th: เป้าหมาย:

# lifeindex.idealRange
source: Ideal range:
th: ช่วงที่เหมาะสม:

# lifeindex.scoreBreakdown
source: Score Breakdown
th: รายละเอียดคะแนน

# lifeindex.howScoringWorks
source: How Scoring Works
th: วิธีการคำนวณคะแนน

# lifeindex.scoringExplanation
source: Your LifeIndex score combines all your health metrics into one easy-to-understand number. Each metric is compared against an optimal range, then weighted by importance.
th: คะแนน LifeIndex รวมตัวชี้วัดสุขภาพทั้งหมดเป็นตัวเลขเดียวที่เข้าใจง่าย แต่ละตัวชี้วัดจะถูกเปรียบเทียบกับช่วงที่เหมาะสม แล้วถ่วงน้ำหนักตามความสำคัญ
